Revit 2027 API
KeynoteEntry Constructor
Overload List
Name | Description
KeynoteEntry(String, String) |  Constructs a new KeynoteEntry from the given key name and keynote text. KeynoteEntry objects created from this constructor will not have parents.
KeynoteEntry(String, String, String) |  Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text.
Top
See Also
Reference
KeynoteEntry Class
Autodesk.Revit.DB Namespace